In [2]:
import numpy as np
import pandas as pd

In [3]:
data=pd.read_csv("Social_Network_Ads.csv")

In [4]:
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
data=data.drop(['User ID'],axis=1)

In [6]:
data['Gender']=data['Gender'].apply({'Male':0,'Female':1}.get)

In [7]:
X=data.drop(['Purchased'],axis=1)
X

     Gender  Age  EstimatedSalary
0         0   19            19000
1         0   35            20000
2         1   26            43000
3         1   27            57000
4         0   19            76000
..      ...  ...              ...
395       1   46            41000
396       0   51            23000
397       1   50            20000
398       0   36            33000
399       1   49            36000

[400 rows x 3 columns]

In [8]:
y=data['Purchased']
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [9]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [10]:
from sklearn.linear_model import LogisticRegression
logmodel=LogisticRegression()

In [11]:
logmodel.fit(X_train,y_train)

LogisticRegression()

In [12]:
y_pred=logmodel.predict(X_test)

In [13]:
print(y_pred)

[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0]

In [14]:
#calculating accuracy of the Classification model
from sklearn.metrics import confusion_matrix, accuracy_score
cm=confusion_matrix(y_test,y_pred)
ac=accuracy_score(y_test,y_pred)

In [15]:
print(cm)

[[48  0]
 [32  0]]

In [16]:
print(ac)

0.6

In [17]:
data.head()

   Gender  Age  EstimatedSalary  Purchased
0       0   19            19000          0
1       0   35            20000          0
2       1   26            43000          0
3       1   27            57000          0
4       0   19            76000          0

In [18]:
#predictions with respect to new dataset
data_new={'Gender':1,'Age':23,'EstimatedSalary':25000}
index=[1]#serial number
my_data=pd.DataFrame(data_new,index)

In [19]:
my_data

   Gender  Age  EstimatedSalary
1       1   23            25000

In [20]:
# Here the logmodel is the variable  used in 10
purchased=logmodel.predict(my_data)
print(f"{purchased}")

[0]